## Production: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 73 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                        NAME                                        |
|--------|------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.idp`                                                          |
|        | `aws_acm_certificate_validation.idp`                                               |
|        | `aws_alb_listener_rule.idp_protocol_version`                                       |
|        | `aws_iam_access_key.idp_send_email`                                                |
|        | `aws_iam_group.idp_send_email`                                                     |
|        | `aws_iam_group_membership.idp_send_email`                                          |
|        | `aws_iam_group_policy_attachment.idp_send_email`                                   |
|        | `aws_iam_policy.idp_send_email`                                                    |
|        | `aws_iam_user.idp_send_email`                                                      |
|        | `aws_lb.idp`                                                                       |
|        | `aws_lb_listener.idp`                                                              |
|        | `aws_lb_listener.idp_http_redirect`                                                |
|        | `aws_lb_target_group.idp[&quot;HTTP1&quot;]`                                                 |
|        | `aws_lb_target_group.idp[&quot;HTTP2&quot;]`                                                 |
|        | `aws_route53_record.idp`                                                           |
|        | `aws_route53_record.idp_dkim_CNAME[0]`                                             |
|        | `aws_route53_record.idp_dkim_CNAME[1]`                                             |
|        | `aws_route53_record.idp_dkim_CNAME[2]`                                             |
|        | `aws_route53_record.idp_dmarc_TXT`                                                 |
|        | `aws_route53_record.idp_ses_verification_TXT`                                      |
|        | `aws_route53_record.idp_spf_TXT`                                                   |
|        | `aws_route53_record.idp_validation[&quot;auth.forms-formulaires.alpha.canada.ca&quot;]`      |
|        | `aws_secretsmanager_secret.zidatel_database_proxy_auth`                            |
|        | `aws_secretsmanager_secret_version.zidatel_database_proxy_auth`                    |
|        | `aws_ses_domain_dkim.idp`                                                          |
|        | `aws_ses_domain_identity.idp`                                                      |
|        | `aws_ses_domain_identity_verification.idp`                                         |
|        | `aws_shield_protection.idp`                                                        |
|        | `aws_ssm_parameter.idp_database_cluster_admin_password`                            |
|        | `aws_ssm_parameter.idp_database_cluster_admin_username`                            |
|        | `aws_ssm_parameter.zitadel_admin_password`                                         |
|        | `aws_ssm_parameter.zitadel_admin_username`                                         |
|        | `aws_ssm_parameter.zitadel_database_host`                                          |
|        | `aws_ssm_parameter.zitadel_database_name`                                          |
|        | `aws_ssm_parameter.zitadel_database_user_password`                                 |
|        | `aws_ssm_parameter.zitadel_database_user_username`                                 |
|        | `aws_ssm_parameter.zitadel_secret_key`                                             |
|        | `aws_wafv2_rule_group.rate_limiters_group_idp`                                     |
|        | `aws_wafv2_web_acl.idp`                                                            |
|        | `aws_wafv2_web_acl_association.idp`                                                |
|        | `aws_wafv2_web_acl_logging_configuration.idp`                                      |
|        | `random_string.idp_alb_tg_suffix`                                                  |
|        | `module.idp_database.aws_cloudwatch_log_group.log_exports[&quot;postgresql&quot;]`           |
|        | `module.idp_database.aws_cloudwatch_log_group.proxy[0]`                            |
|        | `module.idp_database.aws_db_proxy.proxy[0]`                                        |
|        | `module.idp_database.aws_db_proxy_default_target_group.this[0]`                    |
|        | `module.idp_database.aws_db_proxy_target.target[0]`                                |
|        | `module.idp_database.aws_db_subnet_group.rds`                                      |
|        | `module.idp_database.aws_iam_policy.read_connection_string[0]`                     |
|        | `module.idp_database.aws_iam_role.rds_proxy[0]`                                    |
|        | `module.idp_database.aws_iam_role_policy_attachment.read_connection_string[0]`     |
|        | `module.idp_database.aws_rds_cluster.cluster`                                      |
|        | `module.idp_database.aws_rds_cluster_instance.instances[0]`                        |
|        | `module.idp_database.aws_secretsmanager_secret.connection_string[0]`               |
|        | `module.idp_database.aws_secretsmanager_secret.proxy_connection_string[0]`         |
|        | `module.idp_database.aws_secretsmanager_secret_version.connection_string[0]`       |
|        | `module.idp_database.aws_secretsmanager_secret_version.proxy_connection_string[0]` |
|        | `module.idp_database.aws_security_group.rds`                                       |
|        | `module.idp_database.aws_security_group_rule.rds_egress`                           |
|        | `module.idp_database.aws_security_group_rule.rds_ingress`                          |
|        | `module.idp_database.random_string.random`                                         |
|        | `module.idp_ecs.aws_appautoscaling_policy.this[&quot;cpu&quot;]`                             |
|        | `module.idp_ecs.aws_appautoscaling_policy.this[&quot;memory&quot;]`                          |
|        | `module.idp_ecs.aws_appautoscaling_target.this[0]`                                 |
|        | `module.idp_ecs.aws_cloudwatch_log_group.this`                                     |
|        | `module.idp_ecs.aws_ecs_cluster.this[0]`                                           |
|        | `module.idp_ecs.aws_ecs_cluster_capacity_providers.this[0]`                        |
|        | `module.idp_ecs.aws_ecs_service.this`                                              |
|        | `module.idp_ecs.aws_ecs_task_definition.this`                                      |
|        | `module.idp_ecs.aws_iam_policy.this_task_exec`                                     |
|        | `module.idp_ecs.aws_iam_role.this_task`                                            |
|        | `module.idp_ecs.aws_iam_role.this_task_exec`                                       |
|        | `module.idp_ecs.aws_iam_role_policy_attachment.this_task_exec`                     |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/10835261728).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # data.aws_iam_policy_document.idp_send_email will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "idp_send_email" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendRawEmail",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_acm_certificate.idp will be created
  + resource "aws_acm_certificate" "idp" {
      + arn                       = (known after apply)
      + domain_name               = "auth.forms-formulaires.alpha.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "auth.forms-formulaires.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "auth.forms-formulaires.alpha.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.idp will be created
  + resource "aws_acm_certificate_validation" "idp" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb_listener_rule.idp_protocol_version will be created
  + resource "aws_alb_listener_rule" "idp_protocol_version" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/*/v?/*",
                  + "/.well-known/openid-configuration",
                ]
            }
        }
    }

  # aws_iam_access_key.idp_send_email will be created
  + resource "aws_iam_access_key" "idp_send_email" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "idp_send_email"
    }

  # aws_iam_group.idp_send_email will be created
  + resource "aws_iam_group" "idp_send_email" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "idp_send_email"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.idp_send_email will be created
  + resource "aws_iam_group_membership" "idp_send_email" {
      + group = "idp_send_email"
      + id    = (known after apply)
      + name  = "idp_send_email"
      + users = [
          + "idp_send_email",
        ]
    }

  # aws_iam_group_policy_attachment.idp_send_email will be created
  + resource "aws_iam_group_policy_attachment" "idp_send_email" {
      + group      = "idp_send_email"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.idp_send_email will be created
  + resource "aws_iam_policy" "idp_send_email" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "idp_send_email"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_user.idp_send_email will be created
  + resource "aws_iam_user" "idp_send_email" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "idp_send_email"
      + path          = "/"
      + tags_all      = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + unique_id     = (known after apply)
    }

  # aws_lb.idp will be created
  + resource "aws_lb" "idp" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "idp"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + null,
        ]
      + subnets                                                      = [
          + "subnet-0133239e9f30e9b85",
          + "subnet-01cc2a8428d4971fc",
          + "subnet-0251ed3bd219fb8e4",
        ]
      + tags                                                         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                                                     = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "cbs-satellite-957818836222"
          + enabled = true
          + prefix  = "lb_logs"
        }

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.idp will be created
  + resource "aws_lb_listener" "idp" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_listener.idp_http_redirect will be created
  + resource "aws_lb_listener" "idp_http_redirect" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.idp["HTTP1"] will be created
  + resource "aws_lb_target_group" "idp" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0e852a6f3554a8bca"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/debug/healthz"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_lb_target_group.idp["HTTP2"] will be created
  + resource "aws_lb_target_group" "idp" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = "HTTP2"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0e852a6f3554a8bca"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/debug/healthz"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.idp will be created
  + resource "aws_route53_record" "idp" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "auth.forms-formulaires.alpha.canada.ca"
      + type            = "A"
      + zone_id         = "Z1031499PBK3926Y7HKK"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.idp_dkim_CNAME[0] will be created
  + resource "aws_route53_record" "idp_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_route53_record.idp_dkim_CNAME[1] will be created
  + resource "aws_route53_record" "idp_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_route53_record.idp_dkim_CNAME[2] will be created
  + resource "aws_route53_record" "idp_dkim_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_route53_record.idp_dmarc_TXT will be created
  + resource "aws_route53_record" "idp_dmarc_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.auth.forms-formulaires.alpha.canada.ca"
      + records         = [
          + "v=DMARC1; p=reject; sp=reject; pct=100; rua=mailto:CDS.SECURITY-SECURITE.SNC@servicecanada.gc.ca",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_route53_record.idp_ses_verification_TXT will be created
  + resource "aws_route53_record" "idp_ses_verification_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_route53_record.idp_spf_TXT will be created
  + resource "aws_route53_record" "idp_spf_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "auth.forms-formulaires.alpha.canada.ca"
      + records         = [
          + "v=spf1 include:amazonses.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_route53_record.idp_validation["auth.forms-formulaires.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "idp_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_secretsmanager_secret.zidatel_database_proxy_auth will be created
  + resource "aws_secretsmanager_secret" "zidatel_database_proxy_auth" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "zidatel_database_proxy_auth"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.zidatel_database_proxy_auth will be created
  + resource "aws_secretsmanager_secret_version" "zidatel_database_proxy_auth" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_ses_domain_dkim.idp will be created
  + resource "aws_ses_domain_dkim" "idp" {
      + dkim_tokens = (known after apply)
      + domain      = "auth.forms-formulaires.alpha.canada.ca"
      + id          = (known after apply)
    }

  # aws_ses_domain_identity.idp will be created
  + resource "aws_ses_domain_identity" "idp" {
      + arn                = (known after apply)
      + domain             = "auth.forms-formulaires.alpha.canada.ca"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # aws_ses_domain_identity_verification.idp will be created
  + resource "aws_ses_domain_identity_verification" "idp" {
      + arn    = (known after apply)
      + domain = (known after apply)
      + id     = (known after apply)
    }

  # aws_shield_protection.idp will be created
  + resource "aws_shield_protection" "idp" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "LoadBalancerIdP"
      + resource_arn = (known after apply)
      + tags_all     = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_ssm_parameter.idp_database_cluster_admin_password will be created
  + resource "aws_ssm_parameter" "idp_database_cluster_admin_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "idp_database_cluster_admin_password"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.idp_database_cluster_admin_username will be created
  + resource "aws_ssm_parameter" "idp_database_cluster_admin_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "idp_database_cluster_admin_username"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.zitadel_admin_password will be created
  + resource "aws_ssm_parameter" "zitadel_admin_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "zitadel_admin_password"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.zitadel_admin_username will be created
  + resource "aws_ssm_parameter" "zitadel_admin_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "zitadel_admin_username"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.zitadel_database_host will be created
  + resource "aws_ssm_parameter" "zitadel_database_host" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "zitadel_database_host"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.zitadel_database_name will be created
  + resource "aws_ssm_parameter" "zitadel_database_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "zitadel_database_name"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.zitadel_database_user_password will be created
  + resource "aws_ssm_parameter" "zitadel_database_user_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "zitadel_database_user_password"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.zitadel_database_user_username will be created
  + resource "aws_ssm_parameter" "zitadel_database_user_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "zitadel_database_user_username"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.zitadel_secret_key will be created
  + resource "aws_ssm_parameter" "zitadel_secret_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "zitadel_secret_key"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
